/**
 * Created by HZM on 2018/1/31.
 */
function mockTzData() {
    /* mock普通人辨识问题数据 */
    /* type 1为阳虚质，2为阴虚质，3为气虚质，4为痰湿质，5为湿热质，6为血瘀质，7为特禀质，8为气郁质，9为平和质*/
    var data = {
        list: [
            {
                "name": "阳虚质",
                "type": "1",
                "general":"阳气不足，以畏寒怕冷、手足不温等虚寒表现为主要特征。",
                "shape": "肌肉松软不实。",
                "performance": "平素畏冷，手足不温，喜热饮食，精神不振，舌淡胖嫩，脉沉迟。",
                "psychological": "性格多沉静、内向。",
                "disease": "易患痰饮、肿胀、泄泻等病；感邪易从寒化。",
                "adaptability": "耐夏不耐冬；易感风、寒、湿邪。",
                "imgUrl": "yangxz.png",
            },
            {
                "name": "阴虚质",
                "type": "2",
                "general":"阴液亏少，以口燥咽干、手足心热等虚热表现为主要特征。",
                "shape": "体形偏瘦。",
                "performance": "手足心热，口燥咽干，鼻微干，喜冷饮，大便干燥，舌红少津，脉细数。",
                "psychological": "性情急躁，外向好动，活泼。",
                "disease": "易患虚劳、失精、不寐等病；感邪易从热化。",
                "adaptability": "耐冬不耐夏；不耐受暑、热、燥邪。",
                "imgUrl": "yangxz.png"
            },
            {
                "name": "气虚质",
                "type": "3",
                "general":"元气不足，以疲乏、气短、自汗等气虚表现为主要特征。",
                "shape": "肌肉松软不实。",
                "performance": "平素语音低弱，气短懒言，容易疲乏，精神不振，易出汗，舌淡红，舌边有齿痕，脉弱。",
                "psychological": "性格内向，不喜冒险。",
                "disease": "易患感冒、内脏下垂等病；病后康复缓慢。",
                "adaptability": "不耐受风、寒、暑、湿邪。",
                "imgUrl": "qixz.png"
            },
            {
                "name": "痰湿质",
                "type": "4",
                "general":"痰湿凝聚，以形体肥胖、腹部肥满、口黏苔腻等痰湿表现为主要特征。",
                "shape": "体形肥胖，腹部肥满松软。",
                "performance": "面部皮肤油脂较多，多汗且黏，胸闷，痰多，口黏腻或甜，喜食肥甘甜黏，苔腻，脉滑。",
                "psychological": "性格偏温和、稳重，多善于忍耐。",
                "disease": "易患消渴、中风、胸痹等病。",
                "adaptability": "对梅雨季节及湿重环境适应能力差。",
                "imgUrl": "tansz.png"
            },
            {
                "name": "湿热质",
                "type": "5",
                "general":"湿热内蕴，以面垢油光、口苦、苔黄腻等湿热表现为主要特征。",
                "shape": "形体中等或偏瘦。",
                "performance": "面垢油光，易生痤疮，口苦口干，身重困倦，大便黏滞不畅或燥结，小便短黄，男性易阴囊潮湿，女性易带下增多，舌质偏红，苔黄腻，脉滑数。",
                "psychological": "容易心烦急躁。",
                "disease": "易患疮疖、黄疸、热淋等病。",
                "adaptability": "对夏末秋初湿热气候，湿重或气温偏高环境较难适应。",
                "imgUrl": "shirz.png"
            },
            {
                "name": "血瘀质",
                "type": "6",
                "general":"血行不畅，以肤色晦黯、舌质紫黯等血瘀表现为主要特征。",
                "shape": "胖瘦均见。",
                "performance": "肤色晦黯，色素沉着，容易出现瘀斑，口唇黯淡，舌黯或有瘀点，舌下络脉紫黯或增粗，脉涩。",
                "psychological": "易烦，健忘。",
                "disease": "易患症瘕及痛证、血证等。",
                "adaptability": "不耐受寒邪。",
                "imgUrl": "xueyz.png"
            },
            {
                "name": "特禀质",
                "type": "7",
                "general":"先天失常，以生理缺陷、过敏反应等为主要特征。",
                "shape": "过敏体质者一般无特殊；先天禀赋异常者或有畸形，或有生理缺陷。",
                "performance": "过敏体质者常见哮喘、风团、咽痒、鼻塞、喷嚏等；患遗传性疾病者有垂直遗传、先天性、家族性特征；患胎传性疾病者具有母体影响胎儿个体生长发育及相关疾病特征。",
                "psychological": "随禀质不同情况各异。",
                "disease": "过敏体质者易患哮喘、荨麻疹、花粉症及药物过敏等；遗传性疾病如血友病、先天愚型等；胎传性疾病如五迟（立迟、行迟、发迟、齿迟和语迟）、五软（头软、项软、手足软、肌肉软、口软）、解颅、胎惊等。",
                "adaptability": "适应能力差，如过敏体质者对易致过敏季节适应能力差，易引发宿疾。",
                "imgUrl": "tebz.png"
            },
            {
                "name": "气郁质",
                "type": "8",
                "general":"气机郁滞，以神情抑郁、忧虑脆弱等气郁表现为主要特征。",
                "shape": "形体瘦者为多。",
                "performance": "神情抑郁，情感脆弱，烦闷不乐，舌淡红，苔薄白，脉弦。",
                "psychological": "性格内向不稳定、敏感多虑。",
                "disease": "易患脏躁、梅核气、百合病及郁证等。",
                "adaptability": "对精神刺激适应能力较差；不适应阴雨天气。",
                "imgUrl": "qiyz.png"
            },
            {
                "name": "平和质",
                "type": "9",
                "general":"阴阳气血调和，以体态适中、面色红润、精力充沛等为主要特征。",
                "shape": "体形匀称健壮。",
                "performance": "面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，唇色红润，不易疲劳，精力充沛，耐受寒热，睡眠良好，胃纳佳，二便正常，舌色淡红，苔薄白，脉和缓有力。",
                "psychological": "性格随和开朗。",
                "disease": "平素患病较少。",
                "adaptability": "对自然环境和社会环境适应能力较强。",
                "imgUrl": "pinhz.png"
            },
        ],
    }

    return data;
}